In [17]:
import numpy as np

In [18]:
import pandas as pd

## 객체 생성

In [5]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [6]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range('20130101', periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017
2013-01-05 -0.259463  1.614407  1.404147  0.463067
2013-01-06  1.664258 -0.353328  1.195076 -1.669502

In [11]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [20]:
df.head()

                   A         B         C         D
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017
2013-01-05 -0.259463  1.614407  1.404147  0.463067

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.to_numpy()

array([[-0.33595404,  0.4339762 , -0.1581586 , -0.94598091],
       [-0.0373984 , -1.09781784, -0.75006433,  0.55366745],
       [-0.69505621,  1.60430416, -0.23142692,  0.85703449],
       [-1.56102149, -0.30480337,  2.01858088, -1.45701692],
       [-0.25946282,  1.61440698,  1.40414667,  0.4630665 ],
       [ 1.66425775, -0.35332805,  1.19507624, -1.66950231]])

In [24]:
df.tail()

                   A         B         C         D
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017
2013-01-05 -0.259463  1.614407  1.404147  0.463067
2013-01-06  1.664258 -0.353328  1.195076 -1.669502

In [25]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.204106  0.316123  0.579692 -0.366455
std    1.060309  1.112815  1.104483  1.118460
min   -1.561021 -1.097818 -0.750064 -1.669502
25%   -0.605281 -0.341197 -0.213110 -1.329258
50%   -0.297708  0.064586  0.518459 -0.241457
75%   -0.092915  1.311722  1.351879  0.531017
max    1.664258  1.614407  2.018581  0.857034

In [27]:
df

                   A         B         C         D
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017
2013-01-05 -0.259463  1.614407  1.404147  0.463067
2013-01-06  1.664258 -0.353328  1.195076 -1.669502

In [28]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.335954   -0.037398   -0.695056   -1.561021   -0.259463    1.664258
B    0.433976   -1.097818    1.604304   -0.304803    1.614407   -0.353328
C   -0.158159   -0.750064   -0.231427    2.018581    1.404147    1.195076
D   -0.945981    0.553667    0.857034   -1.457017    0.463067   -1.669502

In [29]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.945981 -0.158159  0.433976 -0.335954
2013-01-02  0.553667 -0.750064 -1.097818 -0.037398
2013-01-03  0.857034 -0.231427  1.604304 -0.695056
2013-01-04 -1.457017  2.018581 -0.304803 -1.561021
2013-01-05  0.463067  1.404147  1.614407 -0.259463
2013-01-06 -1.669502  1.195076 -0.353328  1.664258

In [30]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-06  1.664258 -0.353328  1.195076 -1.669502
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-05 -0.259463  1.614407  1.404147  0.463067

## Selection

In [31]:
df['A']

2013-01-01   -0.335954
2013-01-02   -0.037398
2013-01-03   -0.695056
2013-01-04   -1.561021
2013-01-05   -0.259463
2013-01-06    1.664258
Freq: D, Name: A, dtype: float64

In [32]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034

In [34]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017

In [35]:
df.loc[dates[0]]

A   -0.335954
B    0.433976
C   -0.158159
D   -0.945981
Name: 2013-01-01 00:00:00, dtype: float64

In [36]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.335954  0.433976
2013-01-02 -0.037398 -1.097818
2013-01-03 -0.695056  1.604304
2013-01-04 -1.561021 -0.304803
2013-01-05 -0.259463  1.614407
2013-01-06  1.664258 -0.353328

In [37]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02 -0.037398 -1.097818
2013-01-03 -0.695056  1.604304
2013-01-04 -1.561021 -0.304803

## 스칼라값

In [40]:
df.loc[dates[0], 'A']

-0.3359540358601336

In [41]:
df.at[dates[0], 'A']

-0.3359540358601336

## Selection by position

In [42]:
df.iloc[3]

A   -1.561021
B   -0.304803
C    2.018581
D   -1.457017
Name: 2013-01-04 00:00:00, dtype: float64

In [43]:
df

                   A         B         C         D
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017
2013-01-05 -0.259463  1.614407  1.404147  0.463067
2013-01-06  1.664258 -0.353328  1.195076 -1.669502

In [44]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.561021 -0.304803
2013-01-05 -0.259463  1.614407

In [45]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.037398 -0.750064
2013-01-03 -0.695056 -0.231427
2013-01-05 -0.259463  1.404147

In [48]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667
2013-01-03 -0.695056  1.604304 -0.231427  0.857034

In [49]:
df.iloc[1, 1]

-1.0978178417634943

In [50]:
df.iat[1, 1]

-1.0978178417634943

## Boolean indexing

In [51]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-06  1.664258 -0.353328  1.195076 -1.669502

In [52]:
df[df> 0]

                   A         B         C         D
2013-01-01       NaN  0.433976       NaN       NaN
2013-01-02       NaN       NaN       NaN  0.553667
2013-01-03       NaN  1.604304       NaN  0.857034
2013-01-04       NaN       NaN  2.018581       NaN
2013-01-05       NaN  1.614407  1.404147  0.463067
2013-01-06  1.664258       NaN  1.195076       NaN

In [53]:
df2 = df.copy()

In [54]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [55]:
df2

                   A         B         C         D      E
2013-01-01 -0.335954  0.433976 -0.158159 -0.945981    one
2013-01-02 -0.037398 -1.097818 -0.750064  0.553667    one
2013-01-03 -0.695056  1.604304 -0.231427  0.857034    two
2013-01-04 -1.561021 -0.304803  2.018581 -1.457017  three
2013-01-05 -0.259463  1.614407  1.404147  0.463067   four
2013-01-06  1.664258 -0.353328  1.195076 -1.669502  three

In [56]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.695056  1.604304 -0.231427  0.857034   two
2013-01-05 -0.259463  1.614407  1.404147  0.463067  four